tiborsimon/embedded-tdd-headers/pic/pic18/pic18f24k50_tdd.h
#define LC2                           522
#define LATC4                         523
#define LC4                           524
#define LATC5                         525
#define LC5                           526
#define LC6                           527
#define LATC6                         528
#define LATC7                         529
#define LC7                           530
#define CTMUCONL                      531
#define EDG1STAT                      532
#define EDG2STAT                      533
#define EDG1SEL                       534
#define EDG1SEL0                      535
#define EDG1SEL1                      536
#define EDG1POL                       537
#define EDG2SEL0                      538
#define EDG2SEL                       539
#define EDG2SEL1                      540
#define EDG2POL                       541
#define CTMUCONH                      542
#define TRIGEN                        543
#define CTTRIG                        544
#define IDISSEN                       545
#define EDGSEQEN                      546
#define EDGEN                         547
#define TGEN                          548
#define SIDL                          549
#define CTMUSIDL                      550
#define ON                            551
#define CTMUEN                        552
#define CCPR2L                        553
#define CCPR2H                        554
#define TRISA                         555
#define TRISA0                        556
#define TRISA_RA0                     557
#define TRISA1                        558
#define TRISA_RA1                     559
#define TRISA2                        560
#define TRISA_RA2                     561
#define TRISA3                        562
#define TRISA_RA3                     563
#define TRISA_RA4                     564
#define TRISA4                        565
#define TRISA_RA5                     566
#define TRISA5                        567
#define TRISA_RA6                     568
#define TRISA6                        569
#define TRISA_RA7                     570
#define TRISA7                        571
#define TRISB                         572
#define TRISB_RB0                     573
#define TRISB0                        574
#define TRISB_RB1                     575
#define TRISB1                        576
#define TRISB_RB2                     577
#define TRISB2                        578
#define TRISB_RB3                     579
#define TRISB3                        580
#define TRISB_RB4                     581
#define TRISB4                        582
#define TRISB_RB5                     583
#define TRISB5                        584
#define TRISB_RB6                     585
#define TRISB6                        586
#define TRISB_RB7                     587
#define TRISB7                        588
#define TRISC                         589
#define TRISC0                        590
#define TRISC_RC0                     591
#define TRISC1                        592
#define TRISC_RC1                     593
#define TRISC2                        594
#define TRISC_RC2                     595
#define TRISC4                        596
#define TRISC5                        597
#define TRISC6                        598
#define TRISC_RC6                     599
#define TRISC7                        600
#define TRISC_RC7                     601
#define CCP2CON                       602
#define CCP2M                         603
#define CCP2M0                        604
#define CCP2M1                        605
#define CCP2M2                        606
#define CCP2M3                        607
#define DC2B0                         608
#define CCP2Y                         609
#define DC2B                          610
#define DC2B1                         611
#define CCP2X                         612
#define CM1CON0                       613
#define C1CH                          614
#define C1CH0                         615
#define CM1CON0_CCH0                  616
#define CM1CON0_CCH                   617
#define CM1CON0_CCH1                  618
#define C1CH1                         619
#define CM1CON0_CREF                  620
#define C1R                           621
#define C1SP                          622
#define CM1CON0_CPOL                  623
#define C1POL                         624
#define CM1CON0_COE                   625
#define C1OE                          626
#define C1OUT                         627
#define COUT1                         628
#define CM1CON0_CON                   629
#define C1ON                          630
#define CM2CON0                       631
#define CM2CON0_CCH0                  632
#define C2CH0                         633
#define C2CH                          634
#define CM2CON0_CCH                   635
#define CM2CON0_CCH1                  636
#define C2CH1                         637
#define C2R                           638
#define CM2CON0_CREF                  639
#define C2SP                          640
#define C2POL                         641
#define CM2CON0_CPOL                  642
#define CM2CON0_COE                   643
#define C2OE                          644
#define C2OUT                         645
#define COUT2                         646
#define CM2CON0_CON                   647
#define C2ON                          648
#define CM2CON1                       649
#define C2SYNC                        650
#define C1SYNC                        651
#define C2HYS                         652
#define C1HYS                         653
#define C2RSEL                        654
#define C1RSEL                        655
#define MC2OUT                        656
#define MC1OUT                        657
#define OSCTUNE                       658
#define TUN0                          659
#define TUN                           660
#define TUN1                          661
#define TUN2                          662
#define TUN3                          663
#define TUN4                          664
#define TUN5                          665
#define TUN6                          666
#define SPLLMULT                      667
#define HLVDCON                       668
#define HLVDL                         669
#define HLVDL0                        670
#define HLVDL1                        671
#define HLVDL2                        672
#define HLVDL3                        673
#define HLVDEN                        674
#define IRVST                         675
#define BGVST                         676
#define VDIRMAG                       677
#define PIE1                          678
#define TMR1IE                        679
#define TMR2IE                        680
#define CCP1IE                        681
#define SSPIE                         682
#define SSP1IE                        683
#define TXIE                          684
#define TX1IE                         685
#define RCIE                          686
#define RC1IE                         687
#define ADIE                          688
#define STIE                          689
#define PSPIE                         690
#define ACTIE                         691
#define PIR1                          692
#define TMR1IF                        693
#define TMR2IF                        694
#define CCP1IF                        695
#define SSPIF                         696
#define SSP1IF                        697
#define TXIF                          698
#define TX1IF                         699
#define RCIF                          700
#define RC1IF                         701
#define ADIF                          702
#define PSPIF                         703
#define STIF                          704
#define ACTIF                         705
#define IPR1                          706
#define TMR1IP                        707
#define TMR2IP                        708
#define CCP1IP                        709
#define SSP1IP                        710
#define SSPIP                         711
#define TX1IP                         712
#define TXIP                          713
#define RC1IP                         714
#define RCIP                          715
#define ADIP                          716
#define ACTIP                         717
#define PSPIP                         718
#define STIP                          719
#define PIE2                          720
#define CCP2IE                        721
#define TMR3IE                        722
#define HLVDIE                        723
#define LVDIE                         724
#define BCLIE                         725
#define BCL1IE                        726
#define EEIE                          727
#define C2IE                          728
#define CM2IE                         729
#define C1IE                          730
#define CMIE                          731
#define CM1IE                         732
#define OSCFIE                        733
#define PIR2                          734
#define CCP2IF                        735
#define TMR3IF                        736
#define HLVDIF                        737
#define LVDIF                         738
#define BCLIF                         739
#define BCL1IF                        740
#define EEIF                          741
#define C2IF                          742
#define CM2IF                         743
#define C1IF                          744
#define CMIF                          745
#define CM1IF                         746
#define OSCFIF                        747
#define IPR2                          748
#define CCP2IP                        749
#define TMR3IP                        750
#define HLVDIP                        751
#define LVDIP                         752
#define BCL1IP                        753
#define BCLIP                         754
#define EEIP                          755
#define CM2IP                         756
#define C2IP                          757
#define CM1IP                         758
#define C1IP                          759
#define CMIP                          760
#define OSCFIP                        761
#define PIE3                          762
#define TMR1GIE                       763
#define RXB0IE                        764
#define RXBNIE                        765
#define TMR3GIE                       766
#define RXB1IE                        767
#define USBIE                         768
#define TXB0IE                        769
#define TXB1IE                        770
#define CTMUIE                        771
#define PIR3                          772
#define TMR1GIF                       773
#define RXBNIF                        774
#define TMR3GIF                       775
#define USBIF                         776
#define CTMUIF                        777
#define IPR3                          778
#define TMR1GIP                       779
#define TMR3GIP                       780
#define RXBNIP                        781
#define USBIP                         782
#define CTMUIP                        783
#define EECON1                        784
#define RD                            785
#define WR                            786
#define WREN                          787
#define WRERR                         788
#define FREE                          789
#define CFGS                          790
#define EEFS                          791
#define EEPGD                         792
#define EECON2                        793
#define RCSTA1                        794
#define RCD8                          795
#define RX9D                          796
#define OERR                          797
#define FERR                          798
#define ADDEN                         799
#define ADEN                          800
#define CREN                          801
#define SREN                          802
#define SRENA                         803
#define RC8_9                         804
#define RC9                           805
#define RX9                           806
#define SPEN                          807
#define TXSTA1                        808
#define TXD8                          809
#define TX9D1                         810
#define TX9D                          811
#define TRMT                          812
#define TRMT1                         813
#define BRGH1                         814
#define BRGH                          815
#define SENDB1                        816
#define SENDB                         817
#define SYNC                          818
#define SYNC1                         819
#define TXEN1                         820
#define TXEN                          821
#define TX91                          822
#define TX8_9                         823
#define TX9                           824
#define CSRC1                         825
#define CSRC                          826
#define TXREG1                        827
#define RCREG1                        828
#define BRG0                          829
#define SPBRG1                        830
#define BRG1                          831
#define BRG2                          832
#define BRG3                          833
#define BRG4                          834
#define BRG5                          835
#define BRG6                          836
#define BRG7                          837
#define BRG8                          838
#define SPBRGH1                       839
#define BRG9                          840
#define BRG10                         841
#define BRG11                         842
#define BRG12                         843
#define BRG13                         844
#define BRG14                         845
#define BRG15                         846
#define T3CON                         847
#define TMR3ON                        848
#define T3CON_RD16                    849
#define T3RD16                        850
#define nT3SYNC                       851
#define NOT_T3SYNC                    852
#define T3SYNC                        853
#define SOSCEN3                       854
#define T3SOSCEN                      855
#define T3OSCEN                       856
#define T3CON_SOSCEN                  857
#define T3CKPS0                       858
#define T3CKPS                        859
#define T3CKPS1                       860
#define TMR3CS0                       861
#define TMR3CS                        862
#define TMR3CS1                       863
#define RD163                         864
#define TMR3L                         865
#define TMR3H                         866
#define T3GCON                        867
#define T3GSS0                        868
#define T3GSS                         869
#define T3GSS1                        870
#define T3GVAL                        871
#define T3GGO_NOT_DONE                872
#define T3GGO                         873
#define T3GGO_nDONE                   874
#define T3DONE                        875
#define NOT_T3DONE                    876
#define nT3DONE                       877
#define T3GGO_nT3DONE                 878
#define T3GGO_NOT_T3DONE              879
#define T3GSPM                        880
#define T3GTM                         881
#define T3GPOL                        882
#define TMR3GE                        883
#define ACTCON                        884
#define STOR                          885
#define ACTORS                        886
#define ACTOR                         887
#define STLOCK                        888
#define ACTLOCK                       889
#define STSRC                         890
#define ACTSRC                        891
#define STUD                          892
#define ACTUD                         893
#define ACTD                          894
#define ACTEN                         895
#define STEN                          896
#define ACTSEL                        897
#define P1SSBD                        898
#define PSSBD0                        899
#define PSS1BD0                       900
#define PSS1BD                        901
#define PSSBD1                        902
#define PSS1BD1                       903
#define PSSAC0                        904
#define P1SSAC                        905
#define PSS1AC                        906
#define PSS1AC0                       907
#define PSSAC1                        908
#define PSS1AC1                       909
#define ECCP1AS                       910
#define CCP1AS                        911
#define ECCP1AS0                      912
#define ECCP1AS1                      913
#define ECCP1AS2                      914
#define CCP1ASE                       915
#define ECCP1ASE                      916
#define PWM1CON                       917
#define PDC0                          918
#define P1DC                          919
#define PDC1                          920
#define PDC2                          921
#define PDC3                          922
#define PDC4                          923
#define PDC5                          924
#define PDC6                          925
#define P1RSEN                        926
#define PR1SEN                        927
#define BAUDCON1                      928
#define ABDEN1                        929
#define ABDEN                         930
#define WUE1                          931
#define W4E                           932
#define WUE                           933
#define BRG161                        934
#define BRG16                         935
#define CKTXP                         936
#define SCKP1                         937
#define TXCKP                         938
#define TXCKP1                        939
#define SCKP                          940
#define DTRXP1                        941
#define RXDTP1                        942
#define DTRXP                         943
#define RXCKP                         944
#define RXDTP                         945
#define RCMT1                         946
#define RCIDL1                        947
#define RCIDL                         948
#define RCMT                          949
#define ABDOVF                        950
#define ABDOVF1                       951
#define PSTR1CON                      952
#define STR1A                         953
#define STRA                          954
#define STR1B                         955
#define STRB                          956
#define STR1C                         957
#define STRC                          958
#define STR1D                         959
#define STRD                          960
#define STR1SYNC                      961
#define STRSYNC                       962
#define T2CON                         963
#define T2CKPS0                       964
#define T2CKPS                        965
#define T2CKPS1                       966
#define TMR2ON                        967
#define T2OUTPS0                      968
#define T2OUTPS                       969
#define T2OUTPS1                      970
#define T2OUTPS2                      971
#define T2OUTPS3                      972
#define PR2                           973
#define TMR2                          974
#define CCP1CON                       975
#define CCP1M0                        976
#define CCP1M                         977
#define CCP1M1                        978
#define CCP1M2                        979
#define CCP1M3                        980
#define CCP1Y                         981
#define DC1B                          982
#define DC1B0                         983
#define CCP1X                         984
#define DC1B1                         985
#define P1M                           986
#define P1M0                          987
#define P1M1                          988
#define CCPR1L                        989
#define CCPR1H                        990
#define ADCON2                        991
#define ADCS0                         992
#define ADCS                          993
#define ADCS1                         994
#define ADCS2                         995
#define ACQT0                         996
#define ACQT                          997
#define ACQT1                         998
#define ACQT2                         999
#define ADFM                          1000
#define ADCON1                        1001
#define NVCFG                         1002
#define NVCFG0                        1003
#define NVCFG1                        1004
#define PVCFG                         1005
#define PVCFG0                        1006
#define CHSN3                         1007
#define PVCFG1                        1008
#define TRIGSEL                       1009
#define ADCON0                        1010
#define ADON                          1011
#define nDONE                         1012
#define GODONE                        1013
#define GO_nDONE                      1014
#define NOT_DONE                      1015
#define GO_DONE                       1016
#define DONE                          1017
#define GO                            1018
#define GO_NOT_DONE                   1019
#define CHS                           1020
#define SSP1CON2                      1021
#define SEN1                          1022
#define SEN                           1023
#define ADMSK11                       1024
#define RSEN1                         1025
#define RSEN                          1026
#define ADMSK1                        1027
#define PEN                           1028
#define ADMSK21                       1029
#define PEN1                          1030
#define ADMSK2                        1031
#define ADMSK31                       1032
#define RCEN                          1033
#define RCEN1                         1034
#define ADMSK3                        1035
#define ACKEN                         1036
#define ACKEN1                        1037
#define ADMSK41                       1038
#define ADMSK4                        1039
#define ACKDT1                        1040
#define ADMSK51                       1041
#define ADMSK5                        1042
#define ACKDT                         1043
#define ACKSTAT                       1044
#define ACKSTAT1                      1045
#define GCEN                          1046
#define GCEN1                         1047
#define SSP1CON1                      1048
#define SSPM0                         1049
#define SSPM                          1050
#define SSPM01                        1051
#define SSPM1                         1052
#define SSPM11                        1053
#define SSPM2                         1054
#define SSPM21                        1055
#define SSPM31                        1056
#define SSPM3                         1057
#define CKP                           1058
#define CKP1                          1059
#define SSPEN                         1060
#define SSPEN1                        1061
#define SSPOV1                        1062
#define SSPOV                         1063
#define WCOL1                         1064
#define WCOL                          1065
#define SSP1STAT                      1066
#define BF                            1067
#define BF1                           1068
#define UA1                           1069
#define UA                            1070
#define R_NOT_W                       1071
#define READ_WRITE                    1072
#define RW1                           1073
#define NOT_W                         1074
#define R_W                           1075
#define RW                            1076
#define R                             1077
#define nWRITE                        1078
#define nW                            1079
#define R_nW                          1080
#define I2C_READ                      1081
#define START                         1082
#define START1                        1083
#define S                             1084
#define I2C_START                     1085
#define STOP                          1086
#define I2C_STOP                      1087
#define STOP1                         1088
#define P                             1089
#define NOT_A                         1090
